lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/wiring_analog.c
static uint8_t g_pwm_initialized[ANALOG_PWM_INSTANCES] = {0U, 0U};
static uint8_t g_pwm_running[ANALOG_PWM_INSTANCES] = {0U, 0U};
static uint8_t g_pwm_pin_used[ANALOG_PWM_PIN_COUNT] = {
    0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U,
    0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U
};
static uint8_t g_pwm_pin_software[ANALOG_PWM_PIN_COUNT] = {
    0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U,
    0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U
};
static uint8_t g_pwm_pin_channel[ANALOG_PWM_PIN_COUNT] = {
    ANALOG_PWM_NO_CHANNEL, ANALOG_PWM_NO_CHANNEL, ANALOG_PWM_NO_CHANNEL,
    ANALOG_PWM_NO_CHANNEL, ANALOG_PWM_NO_CHANNEL, ANALOG_PWM_NO_CHANNEL,
    ANALOG_PWM_NO_CHANNEL, ANALOG_PWM_NO_CHANNEL, ANALOG_PWM_NO_CHANNEL,
    ANALOG_PWM_NO_CHANNEL, ANALOG_PWM_NO_CHANNEL, ANALOG_PWM_NO_CHANNEL,
    ANALOG_PWM_NO_CHANNEL, ANALOG_PWM_NO_CHANNEL, ANALOG_PWM_NO_CHANNEL,
    ANALOG_PWM_NO_CHANNEL
};
static uint8_t g_pwm_channel_owner[ANALOG_PWM_CHANNELS_PER_INSTANCE] = {
    ANALOG_PWM_NO_PIN, ANALOG_PWM_NO_PIN, ANALOG_PWM_NO_PIN, ANALOG_PWM_NO_PIN
};
static uint16_t g_pwm_pin_pulse[ANALOG_PWM_PIN_COUNT] = {
    0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U,
    0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U
};
static uint16_t g_pwm_sequence[ANALOG_PWM_INSTANCES][ANALOG_PWM_CHANNELS_PER_INSTANCE]
    __attribute__((aligned(4))) = {
    {0U, 0U, 0U, 0U},
    {0U, 0U, 0U, 0U}
};
static uint32_t g_soft_pwm_on_time_us[ANALOG_PWM_PIN_COUNT] = {
    0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U,
    0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U
};
static uint8_t g_soft_pwm_output_high[ANALOG_PWM_PIN_COUNT] = {
    0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U,
    0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U
};
static uint8_t g_pwm_pin_timer_slot[ANALOG_PWM_PIN_COUNT] = {
    ANALOG_PWM_NO_SLOT, ANALOG_PWM_NO_SLOT, ANALOG_PWM_NO_SLOT,
    ANALOG_PWM_NO_SLOT, ANALOG_PWM_NO_SLOT, ANALOG_PWM_NO_SLOT,
    ANALOG_PWM_NO_SLOT, ANALOG_PWM_NO_SLOT, ANALOG_PWM_NO_SLOT,
    ANALOG_PWM_NO_SLOT, ANALOG_PWM_NO_SLOT, ANALOG_PWM_NO_SLOT,
    ANALOG_PWM_NO_SLOT, ANALOG_PWM_NO_SLOT, ANALOG_PWM_NO_SLOT,
    ANALOG_PWM_NO_SLOT
};
static uint8_t g_timer_pwm_slot_owner[ANALOG_TIMER_PWM_SLOT_COUNT] = {
    ANALOG_PWM_NO_PIN, ANALOG_PWM_NO_PIN, ANALOG_PWM_NO_PIN,
    ANALOG_PWM_NO_PIN, ANALOG_PWM_NO_PIN
};
static uint8_t g_timer_pwm_slot_gpiote_channel[ANALOG_TIMER_PWM_SLOT_COUNT] = {
    ANALOG_PWM_NO_CHANNEL, ANALOG_PWM_NO_CHANNEL, ANALOG_PWM_NO_CHANNEL,
    ANALOG_PWM_NO_CHANNEL, ANALOG_PWM_NO_CHANNEL
};
static uint8_t g_timer_pwm_slot_prescaler[ANALOG_TIMER_PWM_SLOT_COUNT] = {
    0U, 0U, 0U, 0U, 0U
};
static uint32_t g_timer_pwm_slot_period_ticks[ANALOG_TIMER_PWM_SLOT_COUNT] = {
    0UL, 0UL, 0UL, 0UL, 0UL
};
static uint32_t g_timer_pwm_slot_pending_high_ticks[ANALOG_TIMER_PWM_SLOT_COUNT] = {
    0UL, 0UL, 0UL, 0UL, 0UL
};
static uint8_t g_timer_pwm_slot_pending_update[ANALOG_TIMER_PWM_SLOT_COUNT] = {
    0U, 0U, 0U, 0U, 0U
};
static uint8_t g_timer_pwm_slot_active[ANALOG_TIMER_PWM_SLOT_COUNT] = {
    0U, 0U, 0U, 0U, 0U
};
static uint32_t g_pwm_pin_frequency_hz[ANALOG_PWM_PIN_COUNT] = {
    0UL, 0UL, 0UL, 0UL, 0UL, 0UL, 0UL, 0UL,
    0UL, 0UL, 0UL, 0UL, 0UL, 0UL, 0UL, 0UL
};
static uint16_t g_pwm_countertop = 16000U;
static uint8_t g_pwm_prescaler = 0U;
static uint32_t g_analog_write_frequency_hz = ANALOG_PWM_DEFAULT_HZ;
static uint32_t g_soft_pwm_period_us = ANALOG_SOFT_PWM_DEFAULT_PERIOD_US;

static const uintptr_t k_pwm_base[ANALOG_PWM_INSTANCES] = {
    (uintptr_t)NRF_PWM20,
    (uintptr_t)NRF_PWM21
};
#ifdef NRF_TRUSTZONE_NONSECURE
static const uintptr_t k_timer_pwm_base[ANALOG_TIMER_PWM_SLOT_COUNT] = {
    0x400CA000UL, 0x400CB000UL, 0x400CC000UL, 0x400CD000UL, 0x400CE000UL
};
static const uintptr_t k_timer_pwm_gpiote_base = 0x400DA000UL;
static const uintptr_t k_timer_pwm_dppic_base = 0x400C2000UL;
#else
static const uintptr_t k_timer_pwm_base[ANALOG_TIMER_PWM_SLOT_COUNT] = {
    0x500CA000UL, 0x500CB000UL, 0x500CC000UL, 0x500CD000UL, 0x500CE000UL
};
static const uintptr_t k_timer_pwm_gpiote_base = 0x500DA000UL;
static const uintptr_t k_timer_pwm_dppic_base = 0x500C2000UL;
#endif
static const pwm_pin_desc_t k_pwm_pin_desc[ANALOG_PWM_PIN_COUNT] = {
    {PIN_D0, 1U, 4U, 0U, ANALOG_PWM_NO_CHANNEL},
    {PIN_D1, 1U, 5U, 0U, ANALOG_PWM_NO_CHANNEL},
    {PIN_D2, 1U, 6U, 0U, ANALOG_PWM_NO_CHANNEL},
    {PIN_D3, 1U, 7U, 0U, ANALOG_PWM_NO_CHANNEL},
    {PIN_D4, 1U, 10U, 0U, ANALOG_PWM_NO_CHANNEL},
    {PIN_D5, 1U, 11U, 0U, ANALOG_PWM_NO_CHANNEL},
    {PIN_D6, 2U, 8U, ANALOG_PWM_INSTANCE_NONE, ANALOG_PWM_NO_CHANNEL},
    {PIN_D7, 2U, 7U, ANALOG_PWM_INSTANCE_NONE, ANALOG_PWM_NO_CHANNEL},
    {PIN_D8, 2U, 1U, ANALOG_PWM_INSTANCE_NONE, ANALOG_PWM_NO_CHANNEL},
    {PIN_D9, 2U, 4U, ANALOG_PWM_INSTANCE_NONE, ANALOG_PWM_NO_CHANNEL},
    {PIN_D10, 2U, 2U, ANALOG_PWM_INSTANCE_NONE, ANALOG_PWM_NO_CHANNEL},
    {PIN_D11, 0U, 3U, ANALOG_PWM_INSTANCE_NONE, ANALOG_PWM_NO_CHANNEL},
    {PIN_D12, 0U, 4U, ANALOG_PWM_INSTANCE_NONE, ANALOG_PWM_NO_CHANNEL},
    {PIN_D13, 2U, 10U, ANALOG_PWM_INSTANCE_NONE, ANALOG_PWM_NO_CHANNEL},
    {PIN_D14, 2U, 9U, ANALOG_PWM_INSTANCE_NONE, ANALOG_PWM_NO_CHANNEL},
    {PIN_D15, 2U, 6U, ANALOG_PWM_INSTANCE_NONE, ANALOG_PWM_NO_CHANNEL}
};

static NRF_GPIO_Type* gpio_for_port(uint8_t port)
{
    switch (port) {
        case 0U: return NRF_P0;
        case 1U: return NRF_P1;
        case 2U: return NRF_P2;
        default: return (NRF_GPIO_Type*)0;
    }
}

static void gpio_prepare_analog_input(uint8_t port, uint8_t pin)
{
    NRF_GPIO_Type* gpio = gpio_for_port(port);
    if (gpio == 0 || pin > 31U) {
        return;
    }

    const uint32_t bit = (1UL << pin);
    uint32_t cnf = gpio->PIN_CNF[pin];
    cnf &= ~(GPIO_PIN_CNF_DIR_Msk |
             GPIO_PIN_CNF_INPUT_Msk |
             GPIO_PIN_CNF_PULL_Msk |
             GPIO_PIN_CNF_SENSE_Msk);
    cnf |= (GPIO_PIN_CNF_DIR_Input << GPIO_PIN_CNF_DIR_Pos);
    // SAADC owns the input path while sampling; disconnect digital path to avoid leakage/pulls.
    cnf |= GPIO_PIN_CNF_INPUT_Disconnect;
    cnf |= GPIO_PIN_CNF_PULL_Disabled;
    cnf |= GPIO_PIN_CNF_SENSE_Disabled;
    gpio->DIRCLR = bit;
    gpio->PIN_CNF[pin] = cnf;
}

static void gpio_write_raw(uint8_t port, uint8_t pin, uint8_t high)
{
    NRF_GPIO_Type* gpio = gpio_for_port(port);
    if (gpio == 0 || pin > 31U) {
        return;
    }

    const uint32_t bit = (1UL << pin);
    gpio->DIRSET = bit;
    if (high != 0U) {
        gpio->OUTSET = bit;
    } else {
        gpio->OUTCLR = bit;
    }
}

