lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/wiring_analog.c
    return 1U;
}

static inline uint32_t make_gpio_psel(uint8_t port, uint8_t pin)
{
    return ((uint32_t)(pin & 0x1FU) << 0U) |
           ((uint32_t)(port & 0x7U) << 5U);
}

static uint8_t pwm_pin_index_for_pin(uint8_t pin, uint8_t* index)
{
    if (index == 0) {
        return 0U;
    }
    for (uint8_t i = 0U; i < ANALOG_PWM_PIN_COUNT; ++i) {
        if (k_pwm_pin_desc[i].arduino_pin == pin) {
            *index = i;
            return 1U;
        }
    }
    return 0U;
}

static uint8_t pwm_pin_can_use_hardware(uint8_t index)
{
    if (index >= ANALOG_PWM_PIN_COUNT) {
        return 0U;
    }
    return (k_pwm_pin_desc[index].pwm_instance == 0U) ? 1U : 0U;
}

static uint8_t pwm_pin_uses_software(uint8_t index)
{
    if (index >= ANALOG_PWM_PIN_COUNT) {
        return 0U;
    }
    return g_pwm_pin_software[index];
}

static uint8_t pwm_acquire_channel(uint8_t index, uint8_t* channel)
{
    if (channel == 0 || pwm_pin_can_use_hardware(index) == 0U) {
        return 0U;
    }

    if (g_pwm_pin_channel[index] != ANALOG_PWM_NO_CHANNEL) {
        *channel = g_pwm_pin_channel[index];
        return 1U;
    }

    for (uint8_t ch = 0U; ch < ANALOG_PWM_CHANNELS_PER_INSTANCE; ++ch) {
        if (g_pwm_channel_owner[ch] == ANALOG_PWM_NO_PIN) {
            g_pwm_channel_owner[ch] = index;
            g_pwm_pin_channel[index] = ch;
            *channel = ch;
            return 1U;
        }
    }
    return 0U;
}

static void pwm_release_channel(uint8_t index)
{
    if (index >= ANALOG_PWM_PIN_COUNT) {
        return;
    }

    const uint8_t channel = g_pwm_pin_channel[index];
    if (channel == ANALOG_PWM_NO_CHANNEL) {
        return;
    }

    g_pwm_pin_channel[index] = ANALOG_PWM_NO_CHANNEL;
    if (channel < ANALOG_PWM_CHANNELS_PER_INSTANCE &&
        g_pwm_channel_owner[channel] == index) {
        g_pwm_channel_owner[channel] = ANALOG_PWM_NO_PIN;
        g_pwm_sequence[0][channel] = 0U;
        if (g_pwm_initialized[0U] != 0U) {
            *regptr(k_pwm_base[0U], PWM_PSEL_OUT0 + ((uintptr_t)channel * PWM_PSEL_OUT_STRIDE)) =
                PWM_PSEL_DISCONNECTED;
        }
    }
}

static void pwm_release_shared_output(uint8_t index)
{
    if (index >= ANALOG_PWM_PIN_COUNT) {
        return;
    }

    if (pwm_pin_can_use_hardware(index) == 0U) {
        return;
    }

    const uint8_t instance = k_pwm_pin_desc[index].pwm_instance;
    pwm_release_channel(index);
    if (pwm_instance_any_dynamic_channel(instance) == 0U) {
        pwm_stop_instance(instance);
    } else {
        pwm_apply_outputs(instance);
    }
}

static void soft_pwm_drive_channel(uint8_t index, uint8_t high)
{
    if (index >= ANALOG_PWM_PIN_COUNT) {
        return;
    }
    if (g_soft_pwm_output_high[index] == high) {
        return;
    }
    g_soft_pwm_output_high[index] = high;
    gpio_write_raw(k_pwm_pin_desc[index].port, k_pwm_pin_desc[index].pin, high);
}

void nrf54l15_analog_write_idle_service(void)
{
    timer_pwm_service_pending_updates();

    uint8_t any_soft_channel = 0U;
    for (uint8_t i = 0U; i < ANALOG_PWM_PIN_COUNT; ++i) {
        if (g_pwm_pin_used[i] != 0U && pwm_pin_uses_software(i) != 0U) {
            any_soft_channel = 1U;
            break;
        }
    }
    if (any_soft_channel == 0U) {
        return;
    }

    const uint32_t now_us = micros();
    for (uint8_t i = 0U; i < ANALOG_PWM_PIN_COUNT; ++i) {
        if (g_pwm_pin_used[i] == 0U || pwm_pin_uses_software(i) == 0U) {
            continue;
        }

        const uint32_t soft_period_us = soft_pwm_period_us_for_pin(i);
        const uint32_t phase_us = now_us % soft_period_us;
        uint8_t high = 0U;
        if (g_pwm_pin_pulse[i] >= g_pwm_countertop) {
            high = 1U;
        } else if (g_pwm_pin_pulse[i] != 0U &&
                   phase_us < g_soft_pwm_on_time_us[i]) {
            high = 1U;
        }
        soft_pwm_drive_channel(i, high);
    }
}

static uint8_t pwm_compute_timing(uint32_t target_hz, uint8_t* prescaler, uint16_t* countertop)
{
    if (prescaler == 0 || countertop == 0 || target_hz == 0UL) {
        return 0U;
    }

    uint32_t best_error = 0xFFFFFFFFUL;
    uint8_t best_prescaler = 0U;
    uint16_t best_countertop = 0U;
    uint8_t found = 0U;

    for (uint8_t p = 0U; p <= 7U; ++p) {
        const uint32_t pwm_clk = 16000000UL >> p;
        if (pwm_clk == 0UL) {
            continue;
        }

        uint32_t top = (pwm_clk + (target_hz / 2UL)) / target_hz;
        if (top < 3UL) {
            top = 3UL;
        }
        if (top > 32767UL) {
            continue;
        }

        const uint32_t actual_hz = pwm_clk / top;
        const uint32_t error = (actual_hz >= target_hz) ? (actual_hz - target_hz) : (target_hz - actual_hz);
        if (!found || error < best_error) {
            found = 1U;
            best_error = error;
            best_prescaler = p;
            best_countertop = (uint16_t)top;
            if (error == 0UL) {
                break;
            }
        }
    }

    if (!found) {
        return 0U;
    }

    *prescaler = best_prescaler;
    *countertop = best_countertop;
    return 1U;
}

static uint8_t pwm_instance_any_dynamic_channel(uint8_t instance)
{
    if (instance >= ANALOG_PWM_INSTANCES) {
        return 0U;
    }
    for (uint8_t ch = 0U; ch < ANALOG_PWM_CHANNELS_PER_INSTANCE; ++ch) {
        const uint8_t owner = g_pwm_channel_owner[ch];
        if (owner == ANALOG_PWM_NO_PIN || owner >= ANALOG_PWM_PIN_COUNT) {
            continue;
        }
        if (g_pwm_pin_pulse[owner] != 0U && g_pwm_pin_pulse[owner] != g_pwm_countertop) {
            return 1U;
        }
    }
    return 0U;
}

static uint8_t pwm_instance_any_used_channel(uint8_t instance)
{
    if (instance >= ANALOG_PWM_INSTANCES) {
        return 0U;
    }
    for (uint8_t ch = 0U; ch < ANALOG_PWM_CHANNELS_PER_INSTANCE; ++ch) {
        const uint8_t owner = g_pwm_channel_owner[ch];
        if (owner != ANALOG_PWM_NO_PIN) {
            return 1U;
        }
    }
    return 0U;
}

static void pwm_disconnect_all(uint8_t instance)
{
    if (instance >= ANALOG_PWM_INSTANCES) {
        return;
    }
    const uintptr_t base = k_pwm_base[instance];
    for (uint8_t ch = 0U; ch < ANALOG_PWM_CHANNELS_PER_INSTANCE; ++ch) {
        *regptr(base, PWM_PSEL_OUT0 + ((uintptr_t)ch * PWM_PSEL_OUT_STRIDE)) = PWM_PSEL_DISCONNECTED;
    }
}

static void pwm_apply_outputs(uint8_t instance)
{
    if (instance >= ANALOG_PWM_INSTANCES) {
        return;
    }

